src/cf/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.ОтгрузкиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателями</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>УказаноНесколькоСерий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтгрузкаТовара</name>
      <type>
        <types>DocumentRef.ОтгрузкаТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСерии</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтгрузкаТовара</name>
      <type>
        <types>DocumentRef.ОтгрузкаТовара</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧДополнительныеРасходы</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыСКонтрагентами</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтгрузкаТовара</name>
      <type>
        <types>DocumentRef.ОтгрузкаТовара</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧЗачётАвансов</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/РеализацияТоваровУслуг/Forms/ФормаДокументаМобильныйКлиент/Module.bsl
&НаКлиенте
Перем ЗакрытиеФормы;

#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтаФорма); 
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	УстановитьВидЦеныПоДоговору();
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Отказ = РаботаСДокументамиКлиент.КлиентуЗапрещеноОтгружать(Объект);
	Если Отказ Тогда Возврат; КонецЕсли;
	Отказ = Не СерииИРазмещениеКлиент.ПроверитьСоответствиеСерийТоварам(ЭтаФорма, Объект.ТЧТовары, Объект.ТЧСерии, ПараметрыЗаписи);
	РаботаСДокументамиКлиент.ПроверитьСуммуАвансовТоварногоДокумента(Объект, Отказ);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	РаботаСДокументамиКлиент.ЗаполнитьДанныеПоТорговойТочке(Объект, ВидЦены, Элементы.ТЧТоварыВидЦены);	
	УстановитьЦеныНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	Объект.Договор = ОбщегоНазначенияВызовСервера.ПолучитьОсновнойДоговор(Объект.Контрагент, Объект.Организация, Истина);
	Объект.Менеджер = РаботаСДокументамиВызовСервера.ПолучитьКуратораДоговора(Объект.Договор, Объект.Дата).Менеджер;
	УстановитьВидЦеныПоДоговору();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	Объект.Менеджер = РаботаСДокументамиВызовСервера.ПолучитьКуратораДоговора(Объект.Договор, Объект.Дата).Менеджер;
	УстановитьВидЦеныПоДоговору();
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьЦены(Команда)
	УстановитьЦеныНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьЦеныПоЗаказу(Команда)
	ПерезаполнитьЦеныПоЗаказуНаСервере();
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Стр, Объект.ЦенаВключаетНДС);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УказатьСерии(Команда)
	СерииИРазмещениеКлиент.УказатьСерии(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьСерии(Команда)
	ЗаполнитьСерииНаСервере();
КонецПроцедуры  

&НаКлиенте
Процедура МестоХраненияПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвансыПоСуммеДокумента(Команда)
	ЗаполнитьПоОстаткамНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвансыВсеНезакрытые(Команда)
	ЗаполнитьПоОстаткамНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТЧЗачётАвансовОснованиеПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧЗачётАвансов.ТекущиеДанные;
	ДанныеСуммы = РаботаСДокументамиВызовСервера.ПолучитьСуммуОснованияДляПлатёжногоДокумента(ТекСтр.Основание);
	ЗаполнитьЗначенияСвойств(ТекСтр, ДанныеСуммы);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекСтр = Элемент.ТекущиеДанные;
		ТекСтр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧТовары);
		ТекСтр.ВидЦены = ВидЦены;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	РаботаСДокументамиКлиент.ПроверитьКратностьЕдиницы(Элемент.ТекущиеДанные, Объект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПередУдалением(Элемент, Отказ)
	Для Каждого Инд Из Элементы.ТЧТовары.ВыделенныеСтроки Цикл
		Стр = Объект.ТЧТовары.НайтиПоИдентификатору(Инд);
		РаботаСДокументамиКлиентСервер.УдалитьСвязанныеСтроки(Объект, "ТЧСерии", Стр.КодСтроки);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриАктивизацииЯчейки(Элемент)
	ТекСтр = Элемент.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда Возврат КонецЕсли;
	Если Элемент.ТекущийЭлемент = Элементы.ТЧТоварыКоличество Тогда
		Элемент.ТекущийЭлемент.ТолькоПросмотр = Не ЗначениеЗаполнено(ТекСтр.Упаковка);	
	КонецЕсли; 
	Если Элемент.ТекущийЭлемент = Элементы.ТЧТоварыЦена Или Элемент.ТекущийЭлемент = Элементы.ТЧТоварыСумма Тогда
		Элемент.ТекущийЭлемент.ТолькоПросмотр = ЗначениеЗаполнено(ТекСтр.ВидЦены);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры 

&НаКлиенте
Процедура ТЧТоварыНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПараметрыАвтоподбора = РаботаСДокументамиКлиент.ПараметрыАвтободбораНоменклатуры();
	ПараметрыАвтоподбора.ВидЦены = ВидЦены;
	ПараметрыАвтоподбора.ИсключитьХарактеристикиДляВнутреннегоИспользования = Истина;
	РаботаСДокументамиКлиент.АвтоподборНоменклатуры(ДанныеВыбора, ПараметрыПолученияДанных, Объект, СтандартнаяОбработка, ПараметрыАвтоподбора);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РаботаСДокументамиКлиент.ОбрабокаВыбораПриАвтоподбореНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, ВыбранноеЗначение, Объект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыХарактеристикаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыУпаковкаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСерияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтр = Элементы.ТЧТовары.ТекущиеДанные;
	ДанныеОтбора = Новый Структура("МестоХранения, Номенклатура, Характеристика, Клиент", Объект.МестоХранения, ТекСтр.Номенклатура, ТекСтр.Характеристика, Объект.Контрагент); 
	СерииИРазмещениеКлиент.ВыбратьСериюПоОстаткам(РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(Объект), ДанныеОтбора,, ТекСтр);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыКоличествоУпаковокПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыКоличествоПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Количество");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыВидЦеныПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьЦенуНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыЦенаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПроцентСкидкиПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаСкидкиПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСтавкаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "СуммаНДС");
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиКоличествоПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧУслуги.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиЦенаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧУслуги.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиСуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧУслуги.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиСтавкаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧУслуги.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиСуммаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "СуммаНДС");
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	РаботаСДокументамиКлиент.ЗаполнитьДанныеПоТорговойТочке(Объект, ВидЦены, Элементы.ТЧТоварыВидЦены);	
	УстановитьЦеныНаСервере();
КонецПроцедуры

#КонецОбласти

#Область Оповещения

&НаКлиенте
Процедура ПослеЗакрытияФормыРедактированияДовоза(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия = Неопределено Тогда Возврат КонецЕсли;
	Если РезультатЗакрытия.Идентификатор = Неопределено Тогда
		Стр = Объект.ТЧТовары.Добавить();
		Стр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧТовары);
	Иначе
		Стр = Объект.ТЧТовары.НайтиПоИдентификатору(РезультатЗакрытия.Идентификатор);
		РаботаСДокументамиКлиентСервер.УдалитьСвязанныеСтроки(Объект, "ТЧСерии", Стр.КодСтроки);
	КонецЕсли;	
	ЗаполнитьЗначенияСвойств(Стр, РезультатЗакрытия,, "КодСтроки");
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Стр, Объект.ЦенаВключаетНДС);
КонецПроцедуры	

#КонецОбласти

#Область Дополнительно  

&НаСервере
Процедура УстановитьЦеныНаСервере()
	РаботаСДокументами.УстановитьЦеныВТабличнойЧасти(Объект.ТЧТовары, ВидЦены, Объект.Дата, Объект.ЦенаВключаетНДС);	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьЦеныПоЗаказуНаСервере()
	Если Не ЗначениеЗаполнено(Объект.Основание) Тогда Возврат КонецЕсли;
	ТЗЗаказ = Объект.Основание.ТЧТовары.Выгрузить();
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		СтрЗаказ = ТЗЗаказ.Найти(Стр.КодСтроки, "КодСтроки");
		Если СтрЗаказ = Неопределено Тогда
			Стр.ВидЦены = Неопределено;
			Стр.Цена = 0;
			Стр.ЦенаSKU = 0;
		Иначе	
			Стр.ВидЦены = СтрЗаказ.ВидЦены;
			Стр.Цена = СтрЗаказ.Цена;
			Стр.ЦенаSKU = СтрЗаказ.ЦенаSKU;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСерииНаСервере()
	СерииИРазмещение.ЗаполнитьСерииПоОстаткам(Объект,Объект.Контрагент);	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОстаткамНаСервере(ВсеНеоплаченные)
	РаботаСДокументами.ПолучитьАвансыДляЗакрытия(Объект, Истина, ВсеНеоплаченные);		
КонецПроцедуры

&НаСервере
Процедура УстановитьВидЦеныПоДоговору()
	ВидЦены = Объект.Договор.ВидЦены;
	РаботаСДокументамиКлиентСервер.ЗаполнитьСписокВыбораВидовЦен(ВидЦены, Элементы.ТЧТоварыВидЦены);
КонецПроцедуры

#КонецОбласти
